Complied by Ebude Yolande

In [4]:
import sqlite3 as sq
import pandas as pd
import datetime as dtm
import warnings
warnings.filterwarnings('ignore')

### 1. Import "GeneratorRefilling.sqlite" and "3057.dat" and change the header of "3057.dat" to ['num','name','surname','date']

Import "GeneratorRefilling.sqlite"

In [5]:
conn=sq.connect('GeneratorRefilling.sqlite')
cur=conn.cursor()
query="SELECT * FROM RefillingGen2018"
data=pd.read_sql(query,conn)
data.head(3)

,Generator,Buyer_Name,Purchase_Quantity,Purchase_Date,Purchase_Time,Payment,Mass,Generator_Amount,Refilling_Name,Refilling_Quantity,Refilling_Date,Refilling_Time,Check
0,Genset1,Andy,756.0,02/01/15,15:25,453600,628.992,756.0,Andy,756.0,03/01/15,07:10,1
1,Genset5,Kate,163.5,04/01/15,10:45,98100,136.032,163.5,Kate,163.5,03/01/15,17:10,1
2,Genset9,Louis,860.0,06/01/15,15:45,516000,715.520,860.0,Kate,800.0,06/01/15,17:40,1

Import 3057.dat and change the header of "3057.dat" to ['num','name','surname','date']

In [6]:
tab = pd.read_table('3057.dat')
temp=tab.columns
tab.columns=['num','name','surname','date'] # change header
tab.iloc[-1]=temp #assign header to last row
tab=tab.sort_index(by='num') # arrange num in ascending order
tab=tab[['num','name','surname','date']]
tab.head(3)

     num       name  surname                    date
199    1   Penelope  Guiness  2013-05-26 14:47:57.62
8     10  Christian    Gable  2013-05-26 14:47:57.62
99   100    Spencer     Depp  2013-05-26 14:47:57.62

2. Create a table in the database for "3057.dat" called Tab3057

In [10]:
tab.to_sql('Tab3057',conn)


3. Delete the "Tab3055" table

In [11]:
query = "DROP TABLE Tab3055"
conn.execute(query)

4. Add a row to Tab3057 table

In [12]:
query= "INSERT INTO Tab3057('index','num','name','surname','date') VALUES ('99','5','Peal','Johnny Walker','2014-01-23 17:47:55')"
conn.execute(query)
query="SELECT * FROM  Tab3057"
tab3057=pd.read_sql(query,conn)
tab3057.tail(3)

     index num   name        surname                    date
198     97  98  Chris        Bridges  2013-05-26 14:47:57.62
199     98  99    Jim         Mostel  2013-05-26 14:47:57.62
200     99   5   Peal  Johnny Walker     2014-01-23 17:47:55

5. Delete the 3rd row of Tab3057

In [13]:
query = "DELETE FROM Tab3057 WHERE num='5'"
conn.execute(query)
query="SELECT * FROM  Tab3057"
tab3057=pd.read_sql(query,conn)
tab3057.tail(3)

     index num   name  surname                    date
196     96  97    Meg    Hawke  2013-05-26 14:47:57.62
197     97  98  Chris  Bridges  2013-05-26 14:47:57.62
198     98  99    Jim   Mostel  2013-05-26 14:47:57.62

6. Add column 'Verify' to Tab3057

In [14]:
query = "ALTER TABLE Tab3057 ADD Verify Varchar(25)"
conn.execute(query)
query="SELECT * FROM  Tab3057"
tab3057=pd.read_sql(query,conn)
tab3057.tail(3)

     index num   name  surname                    date Verify
196     96  97    Meg    Hawke  2013-05-26 14:47:57.62   None
197     97  98  Chris  Bridges  2013-05-26 14:47:57.62   None
198     98  99    Jim   Mostel  2013-05-26 14:47:57.62   None

In [15]:
query = "UPDATE Tab3057 SET Verify='0'"
conn.execute(query)
query = "UPDATE Tab3057 SET Verify='1' WHERE num>50 "
conn.execute(query)
query="SELECT * FROM  Tab3057"
tab3057=pd.read_sql(query,conn)
tab3057.tail(3)

     index num   name  surname                    date Verify
196     96  97    Meg    Hawke  2013-05-26 14:47:57.62      1
197     97  98  Chris  Bridges  2013-05-26 14:47:57.62      1
198     98  99    Jim   Mostel  2013-05-26 14:47:57.62      1